Revit 2026 API

# BuiltInFailuresFilledRegionFailures Class

---

Failures about FilledRegion.

SystemObject Autodesk.Revit.DBBuiltInFailuresFilledRegionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FilledRegionFailures
```
```vb
Public NotInheritable Class FilledRegionFailures
```
```cpp
public ref class FilledRegionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FilledRegionFailures = class end
```

The BuiltInFailuresFilledRegionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BadViewType | [Filled Region Name] can't be placed in 3D Views. |
|  | CannotDrawFilledRegion | Can't draw [Filled Region Name]. |
|  | CannotDrawFilledRegionError | Can't draw [Filled Region Name]. |

#### Reference

Autodesk.Revit.DB Namespace